<?php

/**
* Интерфейс для работы с получением курсов валют из банков
* - реализация методов вынесена в классы для конкретного банка
* - различия в классах связана с тем, что у каждого банка свой формат xml
*/

interface IExchangeBank {
    
    /**
	 * Get valutes from xml of national bank
	 * Получает массив вылют из xml, по разному из каждого нац. банка,
	 * в зависимости от структуры XML конкретного анка
	 * 
	 * @return	array	(массив курсов валют нац. банка конкретной страны)
	 * @access	public
	 */
    public function get_valutes_from_bank();

}
